Tekla Open API Reference for Tekla Structures 2025
WpfShapeCatalog Constructor
Overload List
Name | Description
WpfShapeCatalog()
 Initializes a new instance of the ShapeCatalog class.
WpfShapeCatalog(String)
 Initializes a new instance of the ShapeCatalog class and will select the Shape (if available) in the tree.
Top
See Also
Reference
WpfShapeCatalog Class
Tekla.Structures.Dialog.UIControls Namespace